In [ ]:
!pip install ipython-sql
!pip install mysqlclient

Requirement already satisfied: ipython-sql in /usr/local/lib/python3.10/dist-packages (0.5.0)
Requirement already satisfied: prettytable in /usr/local/lib/python3.10/dist-packages (from ipython-sql) (3.9.0)
Requirement already satisfied: ipython in /usr/local/lib/python3.10/dist-packages (from ipython-sql) (7.34.0)
Requirement already satisfied: sqlalchemy>=2.0 in /usr/local/lib/python3.10/dist-packages (from ipython-sql) (2.0.22)
Requirement already satisfied: sqlparse in /usr/local/lib/python3.10/dist-packages (from ipython-sql) (0.4.4)
Requirement already satisfied: six in /usr/local/lib/python3.10/dist-packages (from ipython-sql) (1.16.0)
Requirement already satisfied: ipython-genutils in /usr/local/lib/python3.10/dist-packages (from ipython-sql) (0.2.0)
Requirement already satisfied: typing-extensions>=4.2.0 in /usr/local/lib/python3.10/dist-packages (from sqlalchemy>=2.0->ipython-sql) (4.5.0)
Requirement already satisfied: greenlet!=0.4.17 in /usr/local/lib/python3.10/dist-packages (from sqlalchemy>=2.0->ipython-sql) (3.0.0)
Requirement already satisfied: setuptools>=18.5 in /usr/local/lib/python3.10/dist-packages (from ipython->ipython-sql) (67.7.2)
Collecting jedi>=0.16 (from ipython->ipython-sql)
  Downloading jedi-0.19.1-py2.py3-none-any.whl (1.6 MB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 1.6/1.6 MB 17.0 MB/s eta 0:00:00
Requirement already satisfied: decorator in /usr/local/lib/python3.10/dist-packages (from ipython->ipython-sql) (4.4.2)
Requirement already satisfied: pickleshare in /usr/local/lib/python3.10/dist-packages (from ipython->ipython-sql) (0.7.5)
Requirement already satisfied: traitlets>=4.2 in /usr/local/lib/python3.10/dist-packages (from ipython->ipython-sql) (5.7.1)
Requirement already satisfied: prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0 in /usr/local/lib/python3.10/dist-packages (from ipython->ipython-sql) (3.0.39)
Requirement already satisfied: pygments in /usr/local/lib/python3.10/dist-packages (from ipython->ipython-sql) (2.16.1)
Requirement already satisfied: backcall in /usr/local/lib/python3.10/dist-packages (from ipython->ipython-sql) (0.2.0)
Requirement already satisfied: matplotlib-inline in /usr/local/lib/python3.10/dist-packages (from ipython->ipython-sql) (0.1.6)
Requirement already satisfied: pexpect>4.3 in /usr/local/lib/python3.10/dist-packages (from ipython->ipython-sql) (4.8.0)
Requirement already satisfied: wcwidth in /usr/local/lib/python3.10/dist-packages (from prettytable->ipython-sql) (0.2.8)
Requirement already satisfied: parso<0.9.0,>=0.8.3 in /usr/local/lib/python3.10/dist-packages (from jedi>=0.16->ipython->ipython-sql) (0.8.3)
Requirement already satisfied: ptyprocess>=0.5 in /usr/local/lib/python3.10/dist-packages (from pexpect>4.3->ipython->ipython-sql) (0.7.0)
Installing collected packages: jedi
Successfully installed jedi-0.19.1
Collecting mysqlclient
  Downloading mysqlclient-2.2.0.tar.gz (89 kB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 89.5/89.5 kB 1.6 MB/s eta 0:00:00
  Installing build dependencies ... done
  Getting requirements to build wheel ... done
  Installing backend dependencies ... done
  Preparing metadata (pyproject.toml) ... done
Building wheels for collected packages: mysqlclient
  Building wheel for mysqlclient (pyproject.toml) ... done
  Created wheel for mysqlclient: filename=mysqlclient-2.2.0-cp310-cp310-linux_x86_64.whl size=123670 sha256=7571027b515cf49f1cc78e469445d2449b9cf4abf659a136138c6aa783b49923
  Stored in directory: /root/.cache/pip/wheels/a4/f8/fd/0399687c0abd03c10c975ed56c692fcd3d0fb80440b5a661f1
Successfully built mysqlclient
Installing collected packages: mysqlclient
Successfully installed mysqlclient-2.2.0

In [ ]:
%load_ext sql

In [ ]:
%sql mysql://A08:A08password@testproject.mysql.database.azure.com:3306/A08

In [ ]:
%sql show databases

 * mysql://A08:***@testproject.mysql.database.azure.com:3306/A08
3 rows affected.

[('a08',), ('information_schema',), ('performance_schema',)]

In [ ]:
%%sql
use a08

 * mysql://A08:***@testproject.mysql.database.azure.com:3306/A08
0 rows affected.

[]

In [ ]:
%%sql
show tables

 * mysql://A08:***@testproject.mysql.database.azure.com:3306/A08
15 rows affected.

[('attributes_new',),
 ('attributes_new_up',),
 ('business_new',),
 ('categories_new',),
 ('categories_new_up',),
 ('checkin',),
 ('checkin_new',),
 ('elite_new',),
 ('elite_new_up',),
 ('hour_new',),
 ('users_new',),
 ('yelp_friends_new',),
 ('yelp_friends_new_up',),
 ('yelp_rev_new',),
 ('yelp_rev_new_up',)]

In [ ]:
%%sql
SELECT *
FROM users_new
limit 1

 * mysql://A08:***@testproject.mysql.database.azure.com:3306/A08
1 rows affected.

[('___6aix-XvFcQz3GauAPpw', 'John', 7, datetime.datetime(2011, 9, 26, 18, 10, 5), 30, 0, 2, 0, 2.75, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)]

In [ ]:
%%sql
select *
FROM business_new
limit 5

 * mysql://A08:***@testproject.mysql.database.azure.com:3306/A08
5 rows affected.

[('___UdvaxCnwsQ7nA1eKZAQ', 'PHLASH', '', 'Philadelphia', 'PA', '19106', 39.9565961073, -75.1650238037, 3.5, 41, 1),
 ('__2LkeVwTuKar5AE95Idzw', "McDonald's", '11007 Bloomingdale Ave', 'Riverview', 'FL', '33569', 27.8931987958, -82.3198442906, 1.5, 13, 1),
 ('__4gkf_0UJW78rkRzFm6Gw', 'Cafe Baladi', '235 Lancaster Ave', 'Malvern', 'PA', '19355', 40.041639063, -75.5428394303, 5.0, 54, 1),
 ('__93GWaEEcUf9TSyyJbkmQ', 'Sunwest Park', '17362 Old Dixie Hwy', 'Hudson', 'FL', '34667', 28.4047847298, -82.6719660624, 3.5, 48, 1),
 ('__AB6oytCW4hD2Jca02kRA', 'Chick-fil-A', '184 W County Ctr N Spc, Space N', 'Des Peres', 'MO', '63131', 38.599651, -90.446909, 3.5, 15, 1)]

In [ ]:
%%sql
SELECT *
FROM attributes_new
limit 5

 * mysql://A08:***@testproject.mysql.database.azure.com:3306/A08
5 rows affected.

[('ByAppointmentOnly: True', 'Pns2l4eNsfO8kk83dixA6A'),
 ('BusinessAcceptsCreditCards: True', 'mpf3x-BjTdTEA3yCZrAYPw'),
 ('BikeParking: True', 'tUFrWirKiKi_TAnsVWINQQ'),
 ('BusinessAcceptsCreditCards: True', 'tUFrWirKiKi_TAnsVWINQQ'),
 ('RestaurantsPriceRange2: 2', 'tUFrWirKiKi_TAnsVWINQQ')]

In [ ]:
%%sql
SELECT *
FROM hour_new
limit 5

 * mysql://A08:***@testproject.mysql.database.azure.com:3306/A08
5 rows affected.

[('Pns2l4eNsfO8kk83dixA6A', None),
 ('mpf3x-BjTdTEA3yCZrAYPw', "'Monday': '0:0-0:0'"),
 ('mpf3x-BjTdTEA3yCZrAYPw', " 'Tuesday': '8:0-18:30'"),
 ('mpf3x-BjTdTEA3yCZrAYPw', " 'Wednesday': '8:0-18:30'"),
 ('mpf3x-BjTdTEA3yCZrAYPw', " 'Thursday': '8:0-18:30'")]

In [ ]:
%%sql
SELECT *
FROM elite_new
limit 5

 * mysql://A08:***@testproject.mysql.database.azure.com:3306/A08
5 rows affected.

[('qVc8ODYU5SZjKXVBgXdI7w', '2007'),
 ('j14WgRoU_-2ZE1aw1dXrJg', '2009'),
 ('j14WgRoU_-2ZE1aw1dXrJg', '2010'),
 ('j14WgRoU_-2ZE1aw1dXrJg', '2011'),
 ('j14WgRoU_-2ZE1aw1dXrJg', '2012')]

In [ ]:
%%sql
SELECT *
FROM tips_updated
limit 5

 * mysql://A08:***@testproject.mysql.database.azure.com:3306/A08
5 rows affected.

[('AGNUgVwnZUey3gcPCJ76iw', '3uLgwr0qeCNMjKenHJwPGQ', 'Avengers time with the ladies.', datetime.datetime(2012, 5, 18, 2, 17, 21), 0),
 ('NBN4MgHP9D3cw--SnauTkA', 'QoezRbYQncpRqyrLH6Iqjg', 'They have lots of good deserts and tasty cuban sandwiches', datetime.datetime(2013, 2, 5, 18, 35, 10), 0),
 ('-copOvldyKh1qr-vzkDEvw', 'MYoRNLb5chwjQe3c_k37Gg', "It's open even when you think it isn't", datetime.datetime(2013, 8, 18, 0, 56, 8), 0),
 ('FjMQVZjSqY8syIO-53KFKw', 'hV-bABTK-glh5wj31ps_Jw', 'Very decent fried chicken', datetime.datetime(2017, 6, 27, 23, 5, 38), 0),
 ('ld0AperBXk1h6UbqmM80zw', '_uN0OudeJ3Zl_tf6nxg5ww', 'Appetizers.. platter special for lunch', datetime.datetime(2012, 10, 6, 19, 43, 9), 0)]

In [ ]:
%%sql
SELECT *
FROM categories_new
limit 5

 * mysql://A08:***@testproject.mysql.database.azure.com:3306/A08
5 rows affected.

[('Pns2l4eNsfO8kk83dixA6A', 'Doctors'),
 ('Pns2l4eNsfO8kk83dixA6A', ' Traditional Chinese Medicine'),
 ('Pns2l4eNsfO8kk83dixA6A', ' Naturopathic/Holistic'),
 ('Pns2l4eNsfO8kk83dixA6A', ' Acupuncture'),
 ('Pns2l4eNsfO8kk83dixA6A', ' Health & Medical')]

In [ ]:
%%sql
SELECT *
FROM yelp_rev_new
limit 1

 * mysql://A08:***@testproject.mysql.database.azure.com:3306/A08
1 rows affected.

[('___44iO4AFtcmV-KB4D-2w', '6wjujUMJ4win3MQM9-C0aA', 'l3Ajic1Gq-oDIXM81SPZ1A', 5.0, 0, 0, 0, "I love this salon! Thomas & Bella have done an amazing job turning it into THE place to get the best mani/pedi in Tucson. I followed my favorite nail tech, Lily, from another salon & I'm so glad I did! The atmosphere is calm & relaxing and everyone is friendly. Well worth the drive to Rita Ranch.", datetime.datetime(2020, 1, 31, 13, 20, 25))]

In [ ]:
%%sql
SELECT *
FROM yelp_friends_new
limit 5

 * mysql://A08:***@testproject.mysql.database.azure.com:3306/A08
5 rows affected.

[('qVc8ODYU5SZjKXVBgXdI7w', 'NSCy54eWehBJyZdG2iE84w'),
 ('qVc8ODYU5SZjKXVBgXdI7w', ' pe42u7DcCH2QmI81NX-8qA'),
 ('qVc8ODYU5SZjKXVBgXdI7w', ' EjlCGf14tYMPJ0rsrL703w'),
 ('qVc8ODYU5SZjKXVBgXdI7w', ' 7OagHIAKx2Rm9z3CQ0OmvA'),
 ('qVc8ODYU5SZjKXVBgXdI7w', ' uZoFvKs0dahfffIqHQf1eA')]

In [ ]:
%%sql
SELECT *
FROM
limit 5

In [ ]:
%%sql
DESCRIBE users

 * mysql://A08:***@testproject.mysql.database.azure.com:3306/A08
21 rows affected.

[('my_row_id', 'bigint unsigned', 'NO', 'PRI', None, 'auto_increment INVISIBLE'),
 ('user_id', 'text', 'YES', '', None, ''),
 ('name', 'text', 'YES', '', None, ''),
 ('review_count', 'bigint', 'YES', '', None, ''),
 ('yelping_since', 'text', 'YES', '', None, ''),
 ('useful', 'bigint', 'YES', '', None, ''),
 ('funny', 'bigint', 'YES', '', None, ''),
 ('cool', 'bigint', 'YES', '', None, ''),
 ('fans', 'bigint', 'YES', '', None, ''),
 ('average_stars', 'double', 'YES', '', None, ''),
 ('compliment_hot', 'bigint', 'YES', '', None, ''),
 ('compliment_more', 'bigint', 'YES', '', None, ''),
 ('compliment_profile', 'bigint', 'YES', '', None, ''),
 ('compliment_cute', 'bigint', 'YES', '', None, ''),
 ('compliment_list', 'bigint', 'YES', '', None, ''),
 ('compliment_note', 'bigint', 'YES', '', None, ''),
 ('compliment_plain', 'bigint', 'YES', '', None, ''),
 ('compliment_cool', 'bigint', 'YES', '', None, ''),
 ('compliment_funny', 'bigint', 'YES', '', None, ''),
 ('compliment_writer', 'bigint', 'YES', '', None, ''),
 ('compliment_photos', 'bigint', 'YES', '', None, '')]

In [ ]:
%%sql
CREATE TABLE users_new(
    user_id VARCHAR(255) NOT NULL PRIMARY KEY,
    name VARCHAR(255),
    review_count BIGINT,
    yelping_since DATETIME,
    useful BIGINT,
    funny BIGINT,
    cool BIGINT,
    fans BIGINT,
    average_stars DOUBLE,
    compliment_hot BIGINT,
    compliment_more BIGINT,
    compliment_profile BIGINT,
    compliment_cute BIGINT,
    compliment_list BIGINT,
    compliment_note BIGINT,
    compliment_plain BIGINT,
    compliment_cool BIGINT,
    compliment_funny BIGINT,
    compliment_writer BIGINT,
    compliment_photos BIGINT
);
INSERT INTO users_new(user_id,name,review_count,yelping_since,useful,funny,cool,fans,average_stars,compliment_hot,compliment_more,compliment_profile,compliment_cute,compliment_list,compliment_note,compliment_plain,compliment_cool,compliment_funny,compliment_writer,compliment_photos)
SELECT user_id,name,review_count,yelping_since,useful,funny,cool,fans,average_stars,compliment_hot,compliment_more,compliment_profile,compliment_cute,compliment_list,compliment_note,compliment_plain,compliment_cool,compliment_funny,compliment_writer,compliment_photos
FROM users;

 * mysql://A08:***@testproject.mysql.database.azure.com:3306/A08
0 rows affected.
1987897 rows affected.

[]

In [ ]:
%%sql
ALTER TABLE business
DROP COLUMN attributes

 * mysql://A08:***@testproject.mysql.database.azure.com:3306/A08
0 rows affected.

[]

In [ ]:
%%sql
describe business

 * mysql://A08:***@testproject.mysql.database.azure.com:3306/A08
13 rows affected.

[('my_row_id', 'bigint unsigned', 'NO', 'PRI', None, 'auto_increment INVISIBLE'),
 ('index', 'bigint', 'YES', 'MUL', None, ''),
 ('business_id', 'text', 'YES', '', None, ''),
 ('name', 'text', 'YES', '', None, ''),
 ('address', 'text', 'YES', '', None, ''),
 ('city', 'text', 'YES', '', None, ''),
 ('state', 'text', 'YES', '', None, ''),
 ('postal_code', 'text', 'YES', '', None, ''),
 ('latitude', 'double', 'YES', '', None, ''),
 ('longitude', 'double', 'YES', '', None, ''),
 ('stars', 'double', 'YES', '', None, ''),
 ('review_count', 'bigint', 'YES', '', None, ''),
 ('is_open', 'bigint', 'YES', '', None, '')]

In [ ]:
%%sql
CREATE TABLE business_new(
  business_id VARCHAR(255) NOT NULL PRIMARY KEY,
  name VARCHAR(255) NOT NULL,
  address VARCHAR(255),
  city VARCHAR(255),
  state VARCHAR(255),
  postal_code VARCHAR(255),
  latitude DOUBLE,
  longitude DOUBLE,
  stars DOUBLE,
  review_count BIGINT,
  is_open BIGINT
);
INSERT INTO business_new(business_id,name,address,city,state,postal_code,latitude,longitude,stars,review_count,is_open)
SELECT business_id,name,address,city,state,postal_code,latitude,longitude,stars,review_count,is_open
FROM business;

 * mysql://A08:***@testproject.mysql.database.azure.com:3306/A08
0 rows affected.
150346 rows affected.

[]

In [ ]:
%%sql
DROP TABLE business

 * mysql://A08:***@testproject.mysql.database.azure.com:3306/A08
0 rows affected.

[]

In [ ]:
%%sql
DESCRIBE tips

 * mysql://A08:***@testproject.mysql.database.azure.com:3306/A08
7 rows affected.

[('my_row_id', 'bigint unsigned', 'NO', 'PRI', None, 'auto_increment INVISIBLE'),
 ('index', 'bigint', 'YES', 'MUL', None, ''),
 ('user_id', 'text', 'YES', '', None, ''),
 ('business_id', 'text', 'YES', '', None, ''),
 ('text', 'text', 'YES', '', None, ''),
 ('date', 'text', 'YES', '', None, ''),
 ('compliment_count', 'bigint', 'YES', '', None, '')]

In [ ]:
%%sql
CREATE TABLE tips_updated_new(
  id INT AUTO_INCREMENT,
  user_id VARCHAR(255) NOT NULL,
  business_id VARCHAR(255),
  text VARCHAR(10000),
  date DATETIME,
  compliment_count BIGINT,
  PRIMARY KEY(id),
  CONSTRAINT tip_business_fk
  FOREIGN KEY (business_id)
  REFERENCES business_new(business_id)
);
INSERT INTO tips_updated_new(user_id,business_id,text,date,compliment_count)
SELECT user_id,business_id,text,date,compliment_count
FROM tips_updated;

 * mysql://A08:***@testproject.mysql.database.azure.com:3306/A08
0 rows affected.
(MySQLdb.ProgrammingError) (1146, "Table 'a08.tips_updated' doesn't exist")
[SQL: INSERT INTO tips_updated_new(user_id,business_id,text,date,compliment_count)
SELECT user_id,business_id,text,date,compliment_count
FROM tips_updated;]
(Background on this error at: https://sqlalche.me/e/20/f405)

In [ ]:
%%sql
SELECT *
FROM tips_updated_new
limit 1

 * mysql://A08:***@testproject.mysql.database.azure.com:3306/A08
0 rows affected.

[]

In [ ]:
%%sql
DROP TABLE tips_updated

 * mysql://A08:***@testproject.mysql.database.azure.com:3306/A08
0 rows affected.

[]

****************************************************ELITE TABLE****************************************

In [ ]:
%%sql
DESCRIBE elite_table

 * mysql://A08:***@testproject.mysql.database.azure.com:3306/A08
3 rows affected.

[('my_row_id', 'bigint unsigned', 'NO', 'PRI', None, 'auto_increment INVISIBLE'),
 ('user_id', 'text', 'YES', '', None, ''),
 ('elite', 'text', 'YES', '', None, '')]

In [ ]:
%%sql
CREATE TABLE elite_new(
  user_id VARCHAR(255),
  elite VARCHAR(255)
);
INSERT INTO elite_new(user_id,elite)
SELECT user_id,elite
FROM elite_table

 * mysql://A08:***@testproject.mysql.database.azure.com:3306/A08
0 rows affected.
2277195 rows affected.

[]

Note: elite_table (original table) was removed after creating elite_new. But later, it was told that we have to create foreign keys too. Therefore i created another table called 'elite_new_up' that defines a primary and foreign key

In [ ]:
%%sql
CREATE TABLE elite_new_up(
  id INT AUTO_INCREMENT,
  user_id VARCHAR(255),
  elite VARCHAR(255),
  PRIMARY KEY (id),
  CONSTRAINT elite_business_fk
  FOREIGN KEY (user_id)
  REFERENCES users_new(user_id)
);
INSERT INTO elite_new_up(user_id,elite)
SELECT user_id,elite
FROM elite_new

 * mysql://A08:***@testproject.mysql.database.azure.com:3306/A08
0 rows affected.
2277195 rows affected.

[]

Checking whether elite_new_up has content in it

In [ ]:
%%sql
SELECT *
FROM elite_new_up
limit 5

 * mysql://A08:***@testproject.mysql.database.azure.com:3306/A08
5 rows affected.

[(1, 'qVc8ODYU5SZjKXVBgXdI7w', '2007'),
 (2, 'j14WgRoU_-2ZE1aw1dXrJg', '2009'),
 (3, 'j14WgRoU_-2ZE1aw1dXrJg', '2010'),
 (4, 'j14WgRoU_-2ZE1aw1dXrJg', '2011'),
 (5, 'j14WgRoU_-2ZE1aw1dXrJg', '2012')]

In [ ]:
Describing the contents of the table

In [ ]:
%%sql
describe elite_new_up

 * mysql://A08:***@testproject.mysql.database.azure.com:3306/A08
3 rows affected.

[('id', 'int', 'NO', 'PRI', None, 'auto_increment'),
 ('user_id', 'varchar(255)', 'YES', 'MUL', None, ''),
 ('elite', 'varchar(255)', 'YES', '', None, '')]

Now we can remove the elite_new table because there is a new table "elite_new_up" in place of it

In [ ]:
%%sql
DROP TABLE elite_new

 * mysql://A08:***@testproject.mysql.database.azure.com:3306/A08
0 rows affected.

[]

In [ ]:
%%sql
show tables

 * mysql://A08:***@testproject.mysql.database.azure.com:3306/A08
15 rows affected.

[('attributes_new',),
 ('attributes_new_up',),
 ('business_new',),
 ('categories_new',),
 ('categories_new_up',),
 ('checkin',),
 ('checkin_new',),
 ('elite_new_up',),
 ('hour_new',),
 ('tips_updated_new',),
 ('users_new',),
 ('yelp_friends_new',),
 ('yelp_friends_new_up',),
 ('yelp_rev_new',),
 ('yelp_rev_new_up',)]

**********************************ATTRIBUTE TABLE************************

In [ ]:
%%sql
DESCRIBE attribute_table

 * mysql://A08:***@testproject.mysql.database.azure.com:3306/A08
3 rows affected.

[('my_row_id', 'bigint unsigned', 'NO', 'PRI', None, 'auto_increment INVISIBLE'),
 ('attributes', 'text', 'YES', '', None, ''),
 ('business_id', 'text', 'YES', '', None, '')]

Note: "attribute_table" was the original table imported from kaggle. We created a new table called "attributes_new" from attribute_table.
After creating attributes_new, we dropped the original attribute_table. Later, we were told to assign a FOREIGN KEY and also mention a new column called "id" as the PRIMARY KEY.

In [ ]:
%%sql
CREATE TABLE attributes_new(
  attributes VARCHAR(255),
  business_id VARCHAR(255)
);
INSERT INTO attributes_new(attributes,business_id)
SELECT attributes,business_id
FROM attribute_table

 * mysql://A08:***@testproject.mysql.database.azure.com:3306/A08
0 rows affected.
1220564 rows affected.

[]

Therefore, we create another table "attributes_new_up" from "attributes_new" with the required specs.
 That is, create an id column which is the PRIMARY KEY and UNIQUE
and assign the business_id as the FOREIGN KEY

In [ ]:
%%sql
CREATE TABLE attributes_new_up(
  id INT AUTO_INCREMENT,
  attributes VARCHAR(255),
  business_id VARCHAR(255),
  PRIMARY KEY (id),
  CONSTRAINT attribute_business_fk
  FOREIGN KEY (business_id)
  REFERENCES business_new(business_id)
);
INSERT INTO attributes_new_up(attributes,business_id)
SELECT attributes,business_id
FROM attributes_new

 * mysql://A08:***@testproject.mysql.database.azure.com:3306/A08
0 rows affected.
1220564 rows affected.

[]

Checking if attributes_new_up has content in it

In [ ]:
%%sql
SELECT *
FROM attributes_new_up
LIMIT 5;

 * mysql://A08:***@testproject.mysql.database.azure.com:3306/A08
5 rows affected.

[(1, 'ByAppointmentOnly: True', 'Pns2l4eNsfO8kk83dixA6A'),
 (2, 'BusinessAcceptsCreditCards: True', 'mpf3x-BjTdTEA3yCZrAYPw'),
 (3, 'BikeParking: True', 'tUFrWirKiKi_TAnsVWINQQ'),
 (4, 'BusinessAcceptsCreditCards: True', 'tUFrWirKiKi_TAnsVWINQQ'),
 (5, 'RestaurantsPriceRange2: 2', 'tUFrWirKiKi_TAnsVWINQQ')]

Describing the contents of attributes_new_up

In [ ]:
%%sql
describe attributes_new_up

 * mysql://A08:***@testproject.mysql.database.azure.com:3306/A08
3 rows affected.

[('id', 'int', 'NO', 'PRI', None, 'auto_increment'),
 ('attributes', 'varchar(255)', 'YES', '', None, ''),
 ('business_id', 'varchar(255)', 'YES', 'MUL', None, '')]

We can drop the attributes_new table now since we have an updated table "attributes_new_up" in place of it

In [ ]:
%%sql
DROP TABLE attributes_new

 * mysql://A08:***@testproject.mysql.database.azure.com:3306/A08
0 rows affected.

[]

**********************************CATEGORIES TABLE******************************

In [ ]:
%%sql
DESCRIBE categories

 * mysql://A08:***@testproject.mysql.database.azure.com:3306/A08
3 rows affected.

[('my_row_id', 'bigint unsigned', 'NO', 'PRI', None, 'auto_increment INVISIBLE'),
 ('business_id', 'text', 'YES', '', None, ''),
 ('categories', 'text', 'YES', '', None, '')]

Note: "categories" was the original table imported from kaggle. We created a new table called "categories_new" from categories.
After creating "categories_new", we dropped the original "categories" table. Later, we were told to assign a FOREIGN KEY and also mention a new column called "id" as the PRIMARY KEY.

In [ ]:
%%sql
CREATE TABLE categories_new(
  business_id VARCHAR(255) NOT NULL,
  categories VARCHAR(255)
);
INSERT INTO categories_new(business_id,categories)
SELECT business_id,categories
FROM categories;

 * mysql://A08:***@testproject.mysql.database.azure.com:3306/A08
0 rows affected.
668695 rows affected.

[]

Therefore, we create another table "categories_new_up" from "categories_new" with the required specifications:
That is, create an id column which is the PRIMARY KEY and UNIQUE
and assign the business_id as the FOREIGN KEY

In [ ]:
%%sql
CREATE TABLE categories_new_up(
  id INT AUTO_INCREMENT,
  business_id VARCHAR(255) NOT NULL,
  categories VARCHAR(255),
  PRIMARY KEY (id),
  CONSTRAINT categories_business_fk
  FOREIGN KEY (business_id)
  REFERENCES business_new(business_id)
);
INSERT INTO categories_new_up(business_id,categories)
SELECT business_id,categories
FROM categories_new;

 * mysql://A08:***@testproject.mysql.database.azure.com:3306/A08
0 rows affected.
668695 rows affected.

[]

Checking if categories_new_up has content

In [ ]:
%%sql
SELECT *
FROM categories_new_up
LIMIT 5

 * mysql://A08:***@testproject.mysql.database.azure.com:3306/A08
5 rows affected.

[(1, 'Pns2l4eNsfO8kk83dixA6A', 'Doctors'),
 (2, 'Pns2l4eNsfO8kk83dixA6A', ' Traditional Chinese Medicine'),
 (3, 'Pns2l4eNsfO8kk83dixA6A', ' Naturopathic/Holistic'),
 (4, 'Pns2l4eNsfO8kk83dixA6A', ' Acupuncture'),
 (5, 'Pns2l4eNsfO8kk83dixA6A', ' Health & Medical')]

Describing the contents of the categories_new_up table

In [ ]:
%%sql
DESCRIBE categories_new_up

 * mysql://A08:***@testproject.mysql.database.azure.com:3306/A08
3 rows affected.

[('id', 'int', 'NO', 'PRI', None, 'auto_increment'),
 ('business_id', 'varchar(255)', 'NO', 'MUL', None, ''),
 ('categories', 'varchar(255)', 'YES', '', None, '')]

Now, we can drop the "categories_new" table since we have an updated table "categories_new_up" in place of it

In [ ]:
%%sql
DROP TABLE categories_new

 * mysql://A08:***@testproject.mysql.database.azure.com:3306/A08
0 rows affected.

[]

*********************************** YELP_REVIEWS*******************************

Note: "yelp_rev" was the original table imported from kaggle.

In [ ]:
%%sql
DESCRIBE yelp_rev

 * mysql://A08:***@testproject.mysql.database.azure.com:3306/A08
11 rows affected.

[('my_row_id', 'bigint unsigned', 'NO', 'PRI', None, 'auto_increment INVISIBLE'),
 ('index', 'bigint', 'YES', 'MUL', None, ''),
 ('review_id', 'text', 'YES', '', None, ''),
 ('user_id', 'text', 'YES', '', None, ''),
 ('business_id', 'text', 'YES', '', None, ''),
 ('stars', 'double', 'YES', '', None, ''),
 ('useful', 'bigint', 'YES', '', None, ''),
 ('funny', 'bigint', 'YES', '', None, ''),
 ('cool', 'bigint', 'YES', '', None, ''),
 ('text', 'text', 'YES', '', None, ''),
 ('date', 'text', 'YES', '', None, '')]

Checking if review_id is a unique table

In [ ]:
%%sql
SELECT COUNT(DISTINCT(review_id))
FROM yelp_rev

 * mysql://A08:***@testproject.mysql.database.azure.com:3306/A08
1 rows affected.

[(6990280,)]

We created a new table called "yelp_rev_new" from the original table "yelp_rev" so that the review_id can be specified as the PRIMARY KEY
After creating "yelp_rev_new", we dropped the original "yelp_rev" table.

In [ ]:
%%sql
CREATE TABLE yelp_rev_new(
  review_id VARCHAR(255) NOT NULL PRIMARY KEY,
  user_id VARCHAR(255),
  business_id VARCHAR(255),
  stars DOUBLE,
  useful BIGINT,
  funny BIGINT,
  cool BIGINT,
  text TEXT,
  date DATETIME
);
INSERT INTO yelp_rev_new(review_id,user_id,business_id,stars,useful,funny,cool,text,date)
SELECT review_id,user_id,business_id,stars,useful,funny,cool,text,date
FROM yelp_rev

 * mysql://A08:***@testproject.mysql.database.azure.com:3306/A08
0 rows affected.
6990280 rows affected.

[]

Later, we were told to assign the business_id as the FOREIGN KEY. So, we create a new table called "yelp_rev_new_up" from "yelp_rev_new"  with the required specifications:
That is, assign the business_id as the FOREIGN KEY

In [ ]:
%%sql
CREATE TABLE yelp_rev_new_up(
  review_id VARCHAR(255) NOT NULL PRIMARY KEY,
  user_id VARCHAR(255),
  business_id VARCHAR(255),
  stars DOUBLE,
  useful BIGINT,
  funny BIGINT,
  cool BIGINT,
  text TEXT,
  date DATETIME,
  CONSTRAINT review_business_fk
  FOREIGN KEY (business_id)
  REFERENCES business_new(business_id)
);
INSERT INTO yelp_rev_new_up(review_id,user_id,business_id,stars,useful,funny,cool,text,date)
SELECT review_id,user_id,business_id,stars,useful,funny,cool,text,date
FROM yelp_rev_new

 * mysql://A08:***@testproject.mysql.database.azure.com:3306/A08
0 rows affected.
6990280 rows affected.

[]

Checking if "yelp_rev_new_up" has valid content

In [ ]:
%%sql
SELECT *
FROM yelp_rev_new_up
limit 2

 * mysql://A08:***@testproject.mysql.database.azure.com:3306/A08
2 rows affected.

[('___44iO4AFtcmV-KB4D-2w', '6wjujUMJ4win3MQM9-C0aA', 'l3Ajic1Gq-oDIXM81SPZ1A', 5.0, 0, 0, 0, "I love this salon! Thomas & Bella have done an amazing job turning it into THE place to get the best mani/pedi in Tucson. I followed my favorite nail tech, Lily, from another salon & I'm so glad I did! The atmosphere is calm & relaxing and everyone is friendly. Well worth the drive to Rita Ranch.", datetime.datetime(2020, 1, 31, 13, 20, 25)),
 ('___7mnNcwBXBN76xXXsYyw', 'gexqRmOpGM7S3XMpx1LySA', 'I2YZuyG1KjiTbtwfNFHaOQ', 5.0, 0, 0, 0, "Such great food and service ..not to mention AMAZING cause!. I would go here EVERY TIME I'm in NOLA!", datetime.datetime(2019, 8, 23, 19, 27, 18))]

Describing the "yelp_rev_new_up" table

In [ ]:
%%sql
DESCRIBE yelp_rev_new_up

 * mysql://A08:***@testproject.mysql.database.azure.com:3306/A08
9 rows affected.

[('review_id', 'varchar(255)', 'NO', 'PRI', None, ''),
 ('user_id', 'varchar(255)', 'YES', '', None, ''),
 ('business_id', 'varchar(255)', 'YES', 'MUL', None, ''),
 ('stars', 'double', 'YES', '', None, ''),
 ('useful', 'bigint', 'YES', '', None, ''),
 ('funny', 'bigint', 'YES', '', None, ''),
 ('cool', 'bigint', 'YES', '', None, ''),
 ('text', 'text', 'YES', '', None, ''),
 ('date', 'datetime', 'YES', '', None, '')]

Now, we can drop the "yelp_rev_new" table since an updated table "yelp_rev_new_up" exists in place of it

In [ ]:
%%sql
DROP TABLE yelp_rev_new

 * mysql://A08:***@testproject.mysql.database.azure.com:3306/A08
0 rows affected.

[]

In [ ]:
%%sql
show tables

 * mysql://A08:***@testproject.mysql.database.azure.com:3306/A08
12 rows affected.

[('attributes_new_up',),
 ('business_new',),
 ('categories_new_up',),
 ('checkin',),
 ('checkin_new',),
 ('elite_new_up',),
 ('hour_new',),
 ('tips_updated_new',),
 ('users_new',),
 ('yelp_friends_new',),
 ('yelp_friends_new_up',),
 ('yelp_rev_new_up',)]

********** YELP_FRIENDS **************

Note: "yelp_friends" was the original table imported from kaggle.

In [ ]:
%%sql
DESCRIBE yelp_friends

 * mysql://A08:***@testproject.mysql.database.azure.com:3306/A08
3 rows affected.

[('my_row_id', 'bigint unsigned', 'NO', 'PRI', None, 'auto_increment INVISIBLE'),
 ('user_id', 'text', 'YES', '', None, ''),
 ('friends', 'text', 'YES', '', None, '')]

We created a new table called "yelp_friends_new" from the original table "yelp_friends". After creating "yelp_friends_new", we dropped the original "yelp_friends" table.

In [ ]:
%%sql
CREATE TABLE yelp_friends_new(
  user_id VARCHAR(255) NOT NULL,
  friends VARCHAR(255)
);
INSERT INTO yelp_friends_new(user_id,friends)
SELECT user_id,friends
FROM yelp_friends

 * mysql://A08:***@testproject.mysql.database.azure.com:3306/A08
0 rows affected.
106104025 rows affected.

[]

Later, we were told to assign the user_id as the FOREIGN KEY and also mention a new column called "id" as the PRIMARY KEY.

Therefore, we create another table "yelp_friends_new_up" from "yelp_friends_new" with the required specifications:
That is, create an id column which is the PRIMARY KEY and UNIQUE
and assign the user_id as the FOREIGN KEY

In [ ]:
%%sql
CREATE TABLE yelp_friends_new_up(
  id INT AUTO_INCREMENT,
  user_id VARCHAR(255) NOT NULL,
  friends VARCHAR(255),
  PRIMARY KEY (id),
  CONSTRAINT friends_business_fk
  FOREIGN KEY (user_id)
  REFERENCES users_new(user_id)
);
INSERT INTO yelp_friends_new_up(user_id,friends)
SELECT user_id,friends
FROM yelp_friends_new

 * mysql://A08:***@testproject.mysql.database.azure.com:3306/A08
0 rows affected.
106104025 rows affected.

[]

Checking if "yelp_friends_new_up" has valid content

In [ ]:
%%sql
SELECT *
FROM yelp_friends_new_up
limit 5

 * mysql://A08:***@testproject.mysql.database.azure.com:3306/A08
5 rows affected.

[(1, 'qVc8ODYU5SZjKXVBgXdI7w', 'NSCy54eWehBJyZdG2iE84w'),
 (2, 'qVc8ODYU5SZjKXVBgXdI7w', ' pe42u7DcCH2QmI81NX-8qA'),
 (3, 'qVc8ODYU5SZjKXVBgXdI7w', ' EjlCGf14tYMPJ0rsrL703w'),
 (4, 'qVc8ODYU5SZjKXVBgXdI7w', ' 7OagHIAKx2Rm9z3CQ0OmvA'),
 (5, 'qVc8ODYU5SZjKXVBgXdI7w', ' uZoFvKs0dahfffIqHQf1eA')]

Describing the "yelp_friends_new_up" table

In [ ]:
%%sql
DESCRIBE yelp_friends_new_up

 * mysql://A08:***@testproject.mysql.database.azure.com:3306/A08
3 rows affected.

[('id', 'int', 'NO', 'PRI', None, 'auto_increment'),
 ('user_id', 'varchar(255)', 'NO', 'MUL', None, ''),
 ('friends', 'varchar(255)', 'YES', '', None, '')]

Now, we can drop the "yelp_friends_new" table since an updated table (yelp_friends_new_up) exists in place of it

In [ ]:
%%sql
DROP TABLE yelp_friends_new

 * mysql://A08:***@testproject.mysql.database.azure.com:3306/A08
0 rows affected.

[]

In [ ]:
%%sql
show tables

 * mysql://A08:***@testproject.mysql.database.azure.com:3306/A08
11 rows affected.

[('attributes_new_up',),
 ('business_new',),
 ('categories_new_up',),
 ('checkin',),
 ('checkin_new',),
 ('elite_new_up',),
 ('hour_new',),
 ('tips_updated_new',),
 ('users_new',),
 ('yelp_friends_new_up',),
 ('yelp_rev_new_up',)]

************ HOUR *****************

"hour" was the original table imported from kaggle.
We created a new table called "hour_new" from the original table "hour". After creating "hour_new", we dropped the original "hour" table.

In [ ]:
%%sql
CREATE TABLE hour_new(
  business_id VARCHAR(255),
  hours TEXT
);
INSERT INTO hour_new(business_id,hours)
SELECT business_id,hours
FROM hour

 * mysql://A08:***@testproject.mysql.database.azure.com:3306/A08
(MySQLdb.OperationalError) (1050, "Table 'hour_new' already exists")
[SQL: CREATE TABLE hour_new(
  business_id VARCHAR(255),
  hours TEXT
);]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

Checking if hours has valid content

In [ ]:
%%sql
SELECT *
FROM hour_new
limit 5;

 * mysql://A08:***@testproject.mysql.database.azure.com:3306/A08
5 rows affected.

[('Pns2l4eNsfO8kk83dixA6A', None),
 ('mpf3x-BjTdTEA3yCZrAYPw', "'Monday': '0:0-0:0'"),
 ('mpf3x-BjTdTEA3yCZrAYPw', " 'Tuesday': '8:0-18:30'"),
 ('mpf3x-BjTdTEA3yCZrAYPw', " 'Wednesday': '8:0-18:30'"),
 ('mpf3x-BjTdTEA3yCZrAYPw', " 'Thursday': '8:0-18:30'")]

Later, we were told to assign the business_id as the FOREIGN KEY and also mention a new column called "id" as the PRIMARY KEY.

Therefore, we create another table "hour_new_up" from "hour_new" with the required specifications:
That is, create an id column which is the PRIMARY KEY and UNIQUE
and assign the business_id as the FOREIGN KEY

In [ ]:
%%sql
CREATE TABLE hour_new_up(
  id INT AUTO_INCREMENT,
  business_id VARCHAR(255) NOT NULL,
  hours TEXT,
  PRIMARY KEY (id),
  CONSTRAINT hour_business_fk
  FOREIGN KEY (business_id)
  REFERENCES business_new(business_id)
);
INSERT INTO hour_new_up(business_id, hours)
SELECT business_id, hours
FROM hour_new

 * mysql://A08:***@testproject.mysql.database.azure.com:3306/A08
0 rows affected.
824238 rows affected.

[]

Checking if hour_new_up has valid content

In [ ]:
%%sql
SELECT *
FROM hour_new_up
LIMIT 5

 * mysql://A08:***@testproject.mysql.database.azure.com:3306/A08
5 rows affected.

[(1, 'Pns2l4eNsfO8kk83dixA6A', None),
 (2, 'mpf3x-BjTdTEA3yCZrAYPw', "'Monday': '0:0-0:0'"),
 (3, 'mpf3x-BjTdTEA3yCZrAYPw', " 'Tuesday': '8:0-18:30'"),
 (4, 'mpf3x-BjTdTEA3yCZrAYPw', " 'Wednesday': '8:0-18:30'"),
 (5, 'mpf3x-BjTdTEA3yCZrAYPw', " 'Thursday': '8:0-18:30'")]

Describing "hour_new_up"

In [ ]:
%%sql
DESCRIBE hour_new_up

 * mysql://A08:***@testproject.mysql.database.azure.com:3306/A08
3 rows affected.

[('id', 'int', 'NO', 'PRI', None, 'auto_increment'),
 ('business_id', 'varchar(255)', 'NO', 'MUL', None, ''),
 ('hours', 'text', 'YES', '', None, '')]

Now, we can delete "hour_new" since it has been updated to hour_new_up

In [ ]:
%%sql
DROP TABLE hour_new

 * mysql://A08:***@testproject.mysql.database.azure.com:3306/A08
0 rows affected.

[]

In [ ]:
%%sql
show tables

 * mysql://A08:***@testproject.mysql.database.azure.com:3306/A08
11 rows affected.

[('attributes_new_up',),
 ('business_new',),
 ('categories_new_up',),
 ('checkin',),
 ('checkin_new',),
 ('elite_new_up',),
 ('hour_new_up',),
 ('tips_updated_new',),
 ('users_new',),
 ('yelp_friends_new_up',),
 ('yelp_rev_new_up',)]

In [ ]:
%%sql
SELECT *
FROM checkin_new
LIMIT 1

 * mysql://A08:***@testproject.mysql.database.azure.com:3306/A08
0 rows affected.

[]